      *%METADATA                                                       *
      * %TEXT Customer Detail                                          *
      *%EMETADATA                                                      *
     A          R CUSTMASTR                 PFILE(CUSTMAST)
     A          K CUSTID
